---
type: FamilyType
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# FamilyType

`Autodesk.Revit.DB.FamilyType` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AsDouble | — | `public Nullable < double > AsDouble ( FamilyParameter familyParameter )` |
| Method | AsElementId | — | `public ElementId AsElementId ( FamilyParameter familyParameter )` |
| Method | AsInteger | — | `public Nullable < int > AsInteger ( FamilyParameter familyParameter )` |
| Method | AsString | — | `public string AsString ( FamilyParameter familyParameter )` |
| Method | AsValueString | — | `public string AsValueString ( FamilyParameter familyParameter )` |
| Method | HasValue | — | `public bool HasValue ( FamilyParameter familyParameter )` |
| Property | Name | — | `public string Name { get ; }` |